function rv = q2rv(q) 
% 将变换四元数转换为旋转矢量。
%
% 样例: rv = q2rv(q) 
% 输入: q - 变换四元数
% Output: rv - 对应的旋转向量, 例如
%              q = [ cos(|rv|/2); sin(|rv|/2)/|rv|*rv ]
%
% 另见  rv2q, qq2rv, qq2phi, m2rv, rv2m, q2att.
% 参考资料：严恭敏教授，陕西西安，西北工业大学，PSIN工具箱程序及相关教材
% 修改：孙德奇，江苏徐州，中国矿业大学，矿山智能采掘装备实验室
% 第一版：2021年8月23日
%%
%说明:
%变换四元数转换为旋转矢量
%首先，将四元数转化为标量非负的四元数；其次根据公式Q=q0+qv=cos(φ/2)+usin(φ/2),先由四元数的标量关系q0=cos(φ/2)求反函数，
%旋转矢量模值的一半(φ/2)=arccos(q0),再由矢量关系qv=(φ/2)*sin(φ/2)/(φ/2)求等效旋转矢量φ=2*((φ/2)/sin(φ/2))*qv.
%%
	if(q(1)<0)
	    q = -q;
	end
    n2 = acos(q(1));
    if n2>1e-40
        k = 2*n2/sin(n2);
    else
        k = 2;
    end
    rv = k*q(2:4);   % q = [ cos(|rv|/2); sin(|rv|/2)/|rv|*rv ];